[
  {
    "company": "Space Dynamics Laboratory",
    "position": "AI Scientist - AI﹠ML Group Lead",
    "startDate": "2023-09-01",
    "endDate": null,
    "description": "Working on autonomous systems and projects for government contracts.",
    "keyPoints": [
      "Developed an imprinting library for on-the-fly labeling in military surveillance drones.",
      "Developed the Networked Collaborative Autonomous (NCA) add-on to the Weapon Open Systems Architecture (WOSA) for the next generation of modular munitions.",
      "Developed a high-performance, low-level, reference router for the Weapon Open Systems Architecture (WOSA)."
    ],
    "link": "https://www.sdl.usu.edu"
  },
  {
    "company": "Milwaukee School of Engineering",
    "position": "Professor (Asst. Rank)",
    "startDate": "2021-08-01",
    "endDate": "2023-09-01",
    "description": "Taught AI and Operating Systems courses; engaged in consulting work and community outreach.",
    "keyPoints": [
      "Created a new curriculum for hands-on OS development.",
      "Created and modified multiple projects for Network Protocols curriculum.",
      "Mentored multiple independent studies courses for deep reinforcement learning, ML weather prediction, and algorithmic trading.",
      "Mentored a capstone research project for deep learning based warehouse monitoring and automation.",
      "Mentored a research project into non-Turing based computational models.",
      "Performed community outreach via multiple consulting projects; mentored a team of students in consulting work."
    ],
    "link": "https://www.msoe.edu"
  },
  {
    "company": "Direct Supply",
    "position": "Visiting Researcher",
    "startDate": "2023-05-01",
    "endDate": "2023-08-01",
    "description": "Conducted research at Direct Supply as a visiting researcher.",
    "keyPoints": [
      "Analyzed transaction data to identify patterns and trends.",
      "Detected anomalous transactions through data analysis.",
      "Created a system to unify disparate company names between organizations."
    ],
    "link": "https://www.directsupply.com"
  },
  {
    "company": "Family 7 Foundations",
    "position": "Technology Consultant",
    "startDate": "2022-09-01",
    "endDate": null,
    "description": "Providing technology consulting services to Family 7 Foundations.",
    "keyPoints": [
      "Created a front-facing website for marketing purposes.",
      "Prepared teacher and student manuals for publication.",
      "Managed email accounts on ProtonMail and custom domains.",
      "Developed a backend SQLite database for internal tools."
    ],
    "link": "https://www.family7foundations.com"
  },
  {
    "company": "Foley & Lardner",
    "position": "Data Science Consultant",
    "startDate": "2022-08-01",
    "endDate": "2023-08-01",
    "description": "Offered data science consulting services to Foley & Lardner.",
    "keyPoints": [
      "Built a series of recommender systems that helped identify missed cross-selling opportunities."
    ],
    "link": "https://www.foley.com"
  },
  {
    "company": "CoreMap",
    "position": "Machine Learning Consultant",
    "startDate": "2022-05-01",
    "endDate": "2022-08-01",
    "description": "Served as a machine learning consultant for CoreMap.",
    "keyPoints": [
      "Developed an algorithm to predict the most efficient locations for ablative heart surgery (a minimally invasive procedure) given a specific atrial fibrillation pattern."
    ],
    "link": "https://coremapmedical.com"
  },
  {
    "company": "Morphology Evolution & Cognition Lab",
    "position": "Research Assistant",
    "startDate": "2017-08-01",
    "endDate": "2021-08-01",
    "description": "Conducted research at the Morphology Evolution & Cognition Lab.",
    "keyPoints": [
      "Published multiple papers on embodied cognition applied to catastrophic forgetting.",
      "Presented papers and research at multiple conferences and seminars.",
      "Reviewed papers for multiple high-tier journals and conferences in robotics and machine learning.",
      "Mentored Master's students in their thesis and projects.",
      "Mentored undergraduate lab members."
    ],
    "link": "https://www.meclab.org"
  },
  {
    "company": "Air Force Research Lab",
    "position": "Research Intern",
    "startDate": "2017-05-01",
    "endDate": "2017-08-01",
    "description": "Interned at the Air Force Research Lab.",
    "keyPoints": [
      "Researched methods for applying deep reinforcement learning in collaborative/swarm environments."
    ],
    "link": "https://www.afrl.af.mil"
  },
  {
    "company": "Perception, Control, & Cognition Lab",
    "position": "Research Assistant",
    "startDate": "2016-05-01",
    "endDate": "2017-05-01",
    "description": "Worked as a research assistant at the Perception, Control, & Cognition Lab.",
    "keyPoints": [
      "Developed a novel method for gradient-based adaptive exploration in deep reinforcement learning."
    ],
    "link": "https://github.com/BYU-PCCL"
  },
  {
    "company": "Brigham Young University",
    "position": "Teaching Assistant",
    "startDate": "2013-01-01",
    "endDate": "2016-05-01",
    "description": "Served as a teaching assistant at Brigham Young University.",
    "keyPoints": [
      "Ran and assisted in teaching the Algorithms course.",
      "Guided students in projects and assignments.",
      "Helped in the creation of new projects and assignments."
    ],
    "link": "https://cs.byu.edu"
  },
  {
    "company": "The Church of Jesus Christ of Latter-Day Saints",
    "position": "Missionary",
    "startDate": "2011-07-01",
    "endDate": "2013-08-01",
    "description": "Proselytized in the Manaus, Brazil Mission.",
    "keyPoints": [
      "Taught various individuals and families the Gospel of Jesus Christ.",
      "Helped individuals and families overcome temporal and spiritual trials and be baptized.",
      "Taught and organized groups of missionaries in proselytizing.",
      "Learned Portuguese and developed interpersonal skills."
    ],
    "link": "https://www.churchofjesuschrist.org"
  }
]
